TSD_TK/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КоличествоЕденицОсновной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЕденицЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TSD_TK/src/InformationRegisters/БуферПодбораТоваров/БуферПодбораТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БуферПодбораТоваров</name>
  <resources>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Избранное</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ЕстьСкидка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TSD_TK/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TSD_TK/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(ПолученныйШтрихкод) Тогда
		
		Штрихкод = ПолученныйШтрихкод;
		СписокШтрихкодов.Добавить(Штрихкод, Штрихкод);
		
		Модифицированность = Истина;
		ШтрихкодыИзменены = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает при сканировании внутренней камерой устройства
//
&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ОформитьСуммовыеПоля(ЭтаФорма, "Цена");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"УдалитьИзПрайсЛиста, СнятьПометкуНаУдаление, РаспечататьЭтикеткуЦенник", "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	
	СтатусИзбранного();
	ЦенаТовара();
	
	НастроитьФормуПоЗначениямНастроек();
	
	Если Параметры.Свойство("ДобавлениеШтрихкодаВПрайсЛист") Тогда
		
		СписокШтрихкодов.Добавить(Параметры.Штрихкод, Параметры.Штрихкод);
		
		ШтрихкодыИзменены = Истина;
		Модифицированность = Истина;
		ДобавлениеШтрихкодаВПрайсЛист = Истина;
		
	ИначеЕсли Параметры.Свойство("Штрихкод") И ЗначениеЗаполнено(Параметры.Штрихкод) Тогда
		
		СписокШтрихкодов.Добавить(Параметры.Штрихкод, Параметры.Штрихкод);
		ШтрихкодыИзменены = Истина;
		
	КонецЕсли;
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПрочитатьШтрихкоды(ТекущийОбъект.Ссылка, СписокШтрихкодов);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ОбновитьИспользуютсяШтрихкоды = Ложь;
	//
	//Если ШтрихкодыИзменены Тогда
	//	
	//	НачатьТранзакцию();
	//	
	//	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Номенклатура.Установить(ТекущийОбъект.Ссылка);
	//	
	//	Для Каждого Штрихкод Из СписокШтрихкодов Цикл
	//		
	//		Запись = НаборЗаписей.Добавить();
	//		Запись.Номенклатура = ТекущийОбъект.Ссылка;
	//		Запись.Штрихкод = Штрихкод;
	//		
	//	КонецЦикла;
	//	
	//	НаборЗаписей.Записать(Истина);
	//	
	//	ЗафиксироватьТранзакцию();
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	Штрихкоды.Штрихкод
	//	|ИЗ
	//	|	РегистрСведений.Штрихкоды КАК Штрихкоды";
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ИспользуютсяШтрихкоды = НЕ РезультатЗапроса.Пустой();
	//	
	//	Если НЕ ИспользуютсяШтрихкоды = ЗначениеНастроекПовтИсп.ИспользуютсяШтрихкоды() Тогда
	//		ОбновитьИспользуютсяШтрихкоды = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если НЕ Объект.Избранное = ЗначениеНастроекПовтИсп.ИспользуютсяИзбранныеТовары() ИЛИ ОбновитьИспользуютсяШтрихкоды Тогда
	//	ОбновитьПовторноИспользуемыеЗначения();
	//	ОповеститьОбИзмененииЗначенийНастроек = Истина;
	//КонецЕсли;
	//
	//Если ЗначениеНастроекВызовСервераПовтИсп.ПрайсЛистПуст() Тогда
	//	ОбновитьПовторноИспользуемыеЗначения();
	//КонецЕсли;
	
	Набор = РегистрыСведений.БуферПодбораТоваров.СоздатьНаборЗаписей();
	Набор.Отбор.Ссылка.Установить(Объект.Ссылка);
	НовыйНабор = Набор.Добавить();
	НовыйНабор.Ссылка  = Объект.Ссылка;
	НовыйНабор.Цена = Цена;
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ОповеститьОбИзмененииЗначенийНастроек Тогда
		Оповестить("ИзмененыЗначенияНастроек");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	КонецЕсли;
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СканироватьШтрихкод(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	Закрыть(Объект.Ссылка);
	
	Оповестить("ЗаписанТовар", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзПрайсЛиста(Команда)
	
	ТекстВопроса =  НСтр("ru = 'Пометить на удаление?
		|Товар будет скрыт из прайс-листа.'");
	
	Оповещение = Новый ОписаниеОповещения("УдалитьИзПрайсЛистаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуНаУдаление(Команда)
	
	ТекстВопроса =  НСтр("ru = 'Снять пометку на удаление?
		|Товар будет отображаться в прайс-листе.'");
	
	Оповещение = Новый ОписаниеОповещения("СнятьПометкуНаУдалениеЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьЭтикеткуЦенник(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Объект.Ссылка);
	
	ОткрытьФорму("Обработка.Сервис.Форма.ПечатьЭтикетокЦенников", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СписокШтрихкодовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеРедактированияШтрихкодов", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокШтрихкодов", СписокШтрихкодов);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.Штрихкоды", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеПриИзменении(Элемент)
	
	//Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() Тогда
	//	ЭтаФорма.Записать();
	//КонецЕсли;
	
	УстановитьИзбранное();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьИзПрайсЛистаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.ПометкаУдаления = Истина;
		Записать();
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуНаУдалениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.ПометкаУдаления = Ложь;
		Записать();
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьШтрихкоды(Ссылка, СписокШтрихкодов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Номенклатура = &Номенклатура
	|";
	
	Запрос.УстановитьПараметр("Номенклатура", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Штрихкоды = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Штрихкод");
		СписокШтрихкодов.ЗагрузитьЗначения(Штрихкоды);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияШтрихкодов(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	СписокШтрихкодов.ЗагрузитьЗначения(Результат.ВыгрузитьЗначения());
	ШтрихкодыИзменены = Истина;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	СписокТолькоПросмотр = "Наименование,Родитель";
	
	СписокВидимость = "СканироватьШтрихкод, Готово";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокТолькоПросмотр, "ТолькоПросмотр",
		НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокВидимость, "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СканироватьШтрихкод", "Видимость",
		ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования()) 
		И НЕ ИспользуетсяАсинхронныйСканер);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаАлкогольнаяПродукция", "Видимость",
	//	ЗначениеНастроекПовтИсп.ИспользуетсяАлкогольнаяПродукция() И ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим());
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаАлкогольныеРеквизиты", "ТолькоПросмотр",
	//	НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим());
	//
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УдалитьИзПрайсЛиста", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() И ЗначениеЗаполнено(Объект.Ссылка) И НЕ Объект.ПометкаУдаления);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СнятьПометкуНаУдаление", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() И Объект.ПометкаУдаления);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "РаспечататьЭтикеткуЦенник", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ПечататьЭтикеткиЦенники());
		
	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма, , "Наименование");
	
	НастроитьЭлементыАсинхронногоСканера();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИзбранное()
	
	Набор =  РегистрыСведений.ИзбранныеТовары.СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Установить(Объект.Ссылка);
	Набор.Прочитать();
	Если Избранное И Набор.Количество() = 0  Тогда
		НовыйНабор = Набор.Добавить();
		НовыйНабор.Номенклатура = Объект.Ссылка;
	ИначеЕсли Избранное = Ложь Тогда
		Набор.Очистить();
	КонецЕсли;
	
	Набор.Записать();
		
	
КонецПроцедуры

&НаСервере
Процедура СтатусИзбранного()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ИзбранныеТовары КАК ИзбранныеТовары
	|ГДЕ
	|	ИзбранныеТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Избранное = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЦенаТовара()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БуферПодбораТоваров.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.БуферПодбораТоваров КАК БуферПодбораТоваров
	|ГДЕ
	|	БуферПодбораТоваров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Цена = Выборка.Цена;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти
